export const ERRORS: Record<string, string> = {
  'cant-get-authentication':
    'Ошибка авторизации. Повторите попытку позже или обратитесь в службу технической поддержки.',

  'permission-denied':
    'Нет прав для выполнения операции. Повторите потыку позже или обратитесь с службу технической поддержки.',

  'cant-find-preparing-connector':
    'Коннектор должен быть подключен к автомобилю. Выполните повторное подключение. После перехода коннектора в режим "ожидание" на экране станции, повторите попытку.',

  'init-amount-calculation-error':
    'Возникла ошибка при расчете стоимости. Повторите попытку позже или обратитесь в службу технической поддержки.',

  'init-amount-is-too-big':
    'Превышено ограничение объема зарядки 100kWh. Повторите попытку позже или обратитесь в службу технической поддержки.',

  'charge-station-is-not-available':
    'Нет связи с зарядной станцией. Повторите попытку позже или обратитесь в службу технической поддержки.',

  'payment-card-doesnt-exists':
    'Ошибка оплаты выбранной картой. Проверьте актуальность платженых средсв или обратитесь в службу технической поддержки',

  'bepaid-error': 'Ошибка оплаты. Повторите попытку позже или обратитесь в службу технической поддержки.',

  'not-enough-money-in-the-account':
    'На внутреннем счете недостаточно средств для старта зарядки. Пополнить счет можно из раздела профиль или на экране выбора средств оплаты',

  'start-transaction-error':
    'Ошибка старта транзакции. Повторите попытку позже или обратитесь в службу технической поддержки.',
  'system-error': 'Системная ошибка',
};
